a = int(input())
b = int(input())
c = int(input())
d = int(input())

if a < b:
    ab = a
else:
    ab = b
if c < d:
    cd = c
else:
    cd = d
if ab < cd:
    print (ab)
else:
    print(cd)


# Напишите программу, которая определяет наименьшее из четырёх чисел.

# Формат входных данных
# На вход программе подаётся четыре целых числа.

# Формат выходных данных
# Программа должна вывести наименьшее из четырёх чисел.

# Примечание. Учитывайте, что минимальные числа могут повторяться (cмотрите тест №
# 5
# 5).

# Тестовые данные 🟢
# Sample Input 1:

# 1
# 2
# 3
# 4
# Sample Output 1:
# 1