# Напишите программу, которая выводит прямоугольник, по периметру состоящий из звездочек (*).

# Примечание. Высота и ширина прямоугольника равны 4 и 17 звёздочкам соответственно.

# Sample Output:

# *****************
# *               *
# *               *
# *****************

print("*****************")
print("*               *")
print("*               *")
print("*****************")


# print(17 * "*")
# print("*", "*", sep=15 * " ")
# print("*", "*", sep=15 * " ")
# print(17 * "*")